In [1]:
import pandas as pd
import numpy as np

In [3]:
sp500 = pd.read_csv("data/sp500.csv", 
                    index_col='Symbol', 
                    usecols=[0, 2, 3, 7])
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

In [5]:
#rename
newSP500 = sp500.rename(columns={'Book Value': 'BookValue'})
newSP500

                        Sector   Price  BookValue
Symbol
MMM                Industrials  141.14     26.668
ABT                Health Care   39.60     15.573
ABBV               Health Care   53.95      2.954
ACN     Information Technology   79.79      8.326
ACE                 Financials  102.91     86.897
...                        ...     ...        ...
YHOO    Information Technology   35.02     12.768
YUM     Consumer Discretionary   74.77      5.147
ZMH                Health Care  101.84     37.181
ZION                Financials   28.43     30.191
ZTS                Health Care   30.53      2.150

[500 rows x 3 columns]

In [21]:
#rename inplace
sp500.rename(columns={'Book Value': 'BookValue'},inplace=True)
sp500

                        Sector   Price  BookValue
Symbol
MMM                Industrials  141.14     26.668
ABT                Health Care   39.60     15.573
ABBV               Health Care   53.95      2.954
ACN     Information Technology   79.79      8.326
ACE                 Financials  102.91     86.897
...                        ...     ...        ...
YHOO    Information Technology   35.02     12.768
YUM     Consumer Discretionary   74.77      5.147
ZMH                Health Care  101.84     37.181
ZION                Financials   28.43     30.191
ZTS                Health Care   30.53      2.150

[500 rows x 3 columns]

In [27]:
#add col
sp500_copy = sp500.copy()
sp500_copy['RoundedPrice'] = sp500.Price.round()
sp500_copy

                        Sector   Price  Book Value  RoundedPrice
Symbol
MMM                Industrials  141.14      26.668         141.0
ABT                Health Care   39.60      15.573          40.0
ABBV               Health Care   53.95       2.954          54.0
ACN     Information Technology   79.79       8.326          80.0
ACE                 Financials  102.91      86.897         103.0
...                        ...     ...         ...           ...
YHOO    Information Technology   35.02      12.768          35.0
YUM     Consumer Discretionary   74.77       5.147          75.0
ZMH                Health Care  101.84      37.181         102.0
ZION                Financials   28.43      30.191          28.0
ZTS                Health Care   30.53       2.150          31.0

[500 rows x 4 columns]

In [17]:
#add new and insert col
copy = sp500.copy()
copy.insert(1, 'RoundedPrice', sp500.Price.round())
copy

                        Sector  RoundedPrice   Price  Book Value
Symbol
MMM                Industrials         141.0  141.14      26.668
ABT                Health Care          40.0   39.60      15.573
ABBV               Health Care          54.0   53.95       2.954
ACN     Information Technology          80.0   79.79       8.326
ACE                 Financials         103.0  102.91      86.897
...                        ...           ...     ...         ...
YHOO    Information Technology          35.0   35.02      12.768
YUM     Consumer Discretionary          75.0   74.77       5.147
ZMH                Health Care         102.0  101.84      37.181
ZION                Financials          28.0   28.43      30.191
ZTS                Health Care          31.0   30.53       2.150

[500 rows x 4 columns]

In [8]:
df = pd.DataFrame(np.arange(12).reshape(4, 3),columns=['a', 'b', 'c'])
df

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [9]:
#add col
df['interim'] = df.apply(lambda row: row.a * row.b, axis=1)
df

   a   b   c  interim
0  0   1   2        0
1  3   4   5       12
2  6   7   8       42
3  9  10  11       90

In [10]:
#Reorder col
reversed_column_names = sp500.columns[::-1]
sp500[reversed_column_names]

        Book Value   Price                  Sector
Symbol
MMM         26.668  141.14             Industrials
ABT         15.573   39.60             Health Care
ABBV         2.954   53.95             Health Care
ACN          8.326   79.79  Information Technology
ACE         86.897  102.91              Financials
...            ...     ...                     ...
YHOO        12.768   35.02  Information Technology
YUM          5.147   74.77  Consumer Discretionary
ZMH         37.181  101.84             Health Care
ZION        30.191   28.43              Financials
ZTS          2.150   30.53             Health Care

[500 rows x 3 columns]

In [21]:
#Delet col
copy = sp500.copy()
del copy['Book Value']
copy

                        Sector   Price
Symbol
MMM                Industrials  141.14
ABT                Health Care   39.60
ABBV               Health Care   53.95
ACN     Information Technology   79.79
ACE                 Financials  102.91
...                        ...     ...
YHOO    Information Technology   35.02
YUM     Consumer Discretionary   74.77
ZMH                Health Care  101.84
ZION                Financials   28.43
ZTS                Health Care   30.53

[500 rows x 2 columns]

In [23]:
#drop col
copy = sp500.copy()
afterdrop = copy.drop(['Sector'], axis = 1)
afterdrop[:5]

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954
ACN      79.79       8.326
ACE     102.91      86.897

In [24]:
#filter complement
selection=sp500.Price > 300
sp500[~selection]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[490 rows x 3 columns]

In [25]:
#replace
s = pd.Series([0., 1., 2., 3., 2., 4.])
s.replace(2,'靠')

0    0.0
1    1.0
2      靠
3    3.0
4      靠
5    4.0
dtype: object

In [28]:
#replace
s.replace({0: 10, 1: 100})

0     10.0
1    100.0
2      2.0
3      3.0
4      2.0
5      4.0
dtype: float64